/*

██   ██ ███████ ██   ██ ████████ ███████ ██████      ███    ███ ██████      ██     ██ ██   ██  █████  ████████ ███████  █████  ██████  ██████      ██████   ██████  ████████ 
██   ██ ██       ██ ██     ██    ██      ██   ██     ████  ████ ██   ██     ██     ██ ██   ██ ██   ██    ██    ██      ██   ██ ██   ██ ██   ██     ██   ██ ██    ██    ██    
███████ █████     ███      ██    █████   ██████      ██ ████ ██ ██   ██     ██  █  ██ ███████ ███████    ██    ███████ ███████ ██████  ██████      ██████  ██    ██    ██    
██   ██ ██       ██ ██     ██    ██      ██   ██     ██  ██  ██ ██   ██     ██ ███ ██ ██   ██ ██   ██    ██         ██ ██   ██ ██      ██          ██   ██ ██    ██    ██    
██   ██ ███████ ██   ██    ██    ███████ ██   ██     ██      ██ ██████       ███ ███  ██   ██ ██   ██    ██    ███████ ██   ██ ██      ██          ██████   ██████     ██    
                                                                                                                                                                             
                                                                                                                                                                             
Project Name : Your Project Name
Developed By ; Your Name
Version : 1.0

Enter Your Details As You Wish

Dont,t Try To Decrypt My Code.
*/


const _0xf42f67=_0x5efa;function _0x5efa(_0x27c98c,_0x389f8d){const _0x1c912e=_0x1c91();return _0x5efa=function(_0x5efab9,_0x160da3){_0x5efab9=_0x5efab9-0x1bb;let _0x596101=_0x1c912e[_0x5efab9];return _0x596101;},_0x5efa(_0x27c98c,_0x389f8d);}(function(_0x5327eb,_0x2b56e1){const _0x41bcab=_0x5efa,_0xddc7fd=_0x5327eb();while(!![]){try{const _0x5223d3=-parseInt(_0x41bcab(0x1c6))/0x1*(parseInt(_0x41bcab(0x1c5))/0x2)+parseInt(_0x41bcab(0x1be))/0x3+-parseInt(_0x41bcab(0x1c1))/0x4+parseInt(_0x41bcab(0x1c2))/0x5*(parseInt(_0x41bcab(0x1c0))/0x6)+-parseInt(_0x41bcab(0x1c4))/0x7+parseInt(_0x41bcab(0x1bd))/0x8*(-parseInt(_0x41bcab(0x1c3))/0x9)+parseInt(_0x41bcab(0x1bf))/0xa*(parseInt(_0x41bcab(0x1bc))/0xb);if(_0x5223d3===_0x2b56e1)break;else _0xddc7fd['push'](_0xddc7fd['shift']());}catch(_0x24fb47){_0xddc7fd['push'](_0xddc7fd['shift']());}}}(_0x1c91,0x4e231));const {getCredit}=require('hexter-md'),commands=[{'name':'credit','react':'💖','start':async(_0x1aaa84,_0x436666)=>{await getCredit(_0x1aaa84,_0x436666);}}];function _0x1c91(){const _0x5a5f41=['20UkyDeM','261654gPttvN','2212164TJirDX','25eReKiS','40041WYIfUi','301833GZCCXK','386602YwbNFr','1smeLqX','exports','7011499FBAAbi','872PzMOem','304764urRCGf'];_0x1c91=function(){return _0x5a5f41;};return _0x1c91();}module[_0xf42f67(0x1bb)]=commands;
